Autodesk.Revit.DB.MaterialPropertyPathType
Enum class indicating kinds of paths which ExternalFileReferenceType.Material
references can have.
Since:
2012
Since:
2012

Autodesk.Revit.DB.MaterialPropertyPathType.Weathering
Weathering image, for concrete materials

Autodesk.Revit.DB.MaterialPropertyPathType.ReliefPattern
Relief pattern, for various material types

Autodesk.Revit.DB.MaterialPropertyPathType.FinishBumps
Finish bumps, pattern for various material types

Autodesk.Revit.DB.MaterialPropertyPathType.Bump
Bump pattern, for generic materials

Autodesk.Revit.DB.MaterialPropertyPathType.Cutouts
Cutouts image, for generic or metal materials

Autodesk.Revit.DB.MaterialPropertyPathType.Transparency
Transparency image, for generic materials

Autodesk.Revit.DB.MaterialPropertyPathType.General
General image, for various material types